package object201900530;

// 주석 2: 클래스상속
public class HistoryFeature extends MainMenu{
	// 메뉴를 출력하는 메소드
	public void openMenu() {
		System.out.println("************************************************************************");
		System.out.println("		목록");
		System.out.println("		1. 역사");
		System.out.println("		2. 특징");
		System.out.println("		3. 뒤로");
		System.out.println("************************************************************************");
		selectMenu();
	}
	
	// 사용자가 메뉴를 고르는 메소드는 Menu의 selectMenu와 같음

	// 사용자가 고른 메뉴로 이동함
	public void goMenu(String menu) {
		if(menu.equals("역사") || menu.equals("1")) {
			System.out.println("다른 여느 나라가 그렇듯이 한식은 여러가지 경로와 계층을 통해 발전했다.\n"
					+ "궁중 음식\n"
					+ "삼국시대 이후 중앙 집권이 굳혀지며 이어져 내려온 화려한 상차림. 특별히 치우쳐진 바 없이 여러 지역의 식재를 골라 다양하게 섞어 쓴다는 특징이 있다.\n"
					+ "개성 한정식은 반가 음식이긴 하나 궁중 음식의 화려한 특징을 가졌으며 수도권 위주로 왕실의 영향을 받아 실질적으로는 궁중 음식에 가깝다.\n"
					+ "반가 음식\n"
					+ "삼국시대의 호족, 고려시대의 문벌 귀족과 조선의 양반가를 통해 이어진 가문의 전통적 음식. 대표적으로 전라도에서 발전한 남도 한정식이 있으며,\n"
					+ "해당 산지의 음식을 신선하게 쓰는 경우가 많다.\n"
					+ "사찰 음식\n"
					+ "삼국시대와 고려시대 불교의 발전과 함께 빚어진 채식 위주의 담백한 식당. 그러나 조선대의 숭유억불과 일제 강점기 토속 불교 억압n"
					+ "6.25의 전란으로 인해 매우 많은 요소가 소실되었다.\n"
					+ "서민 음식\n"
					+ "지역 별로 가장 많이 분포했던 서민들이 소박하게 먹었던 음식. 대체로 각 지역에 존재했던 양반가의 영향을 받았으나 다소 간촐하게 열화된 음식을 먹었으며,\n"
					+ "조선 후기에 이르러 주막 문화의 발달과 함께 발전했다. 현재 우리가 즐기는 대부분의 음식이다." );
			openMenu();
		}
		else if(menu.equals("특징") || menu.equals("2")) {
			System.out.println("맵다 식사를 구성하는 요소들이 매운 맛을 기반으로 하고 있는 경우가 많아, 식사 내내 적당한 매운맛이 오랫동안 유지되는 편이다.\n"
					 + "뜨겁다\n"
					 + "해외 요리에 비해 매우 뜨거운 요리를 선호하는 것 역시 특징이다. 돌솥비빔밥이 좋은 예이다. 물론 채소까지 무조건 익혀서 내놓는 중국 요리와 달리 나물 종류는\n"
					 + "차게 해서 내놓는 경우도 있고 익혀서 내놓는 경우도 있지만, 보통은 찌개, 찜, 국, 부침처럼 엄청 뜨겁게 푹 익힌 요리를 먹는 경우가 많은 편이다.\n"
					 + "강한향\n"
					 + "음식은 그 향도 어느 정도 영향을 미치는데, 한국 요리는 대체적으로 향이 센 편으로, 익숙하지 않은 사람에겐 어려울 수 있다. 첫 번째 이유는 바로 발효음식으로,\n"
					 + "된장찌개, 청국장 등이 대표적인 예다. 김치도 당연히 상당히 심한 편이라 위의 예시들보다는 덜하지만 김치찌개 역시 외국인들의 입장에서는 거부감이 드는 냄새가 나기 쉽다.\n"
					 + "반찬\n"
					 + "한국 요리는 옛날부터 반찬과 밥을 동시에 소비하는 체계가 시스템으로 굳어져 있었고 3첩 반상, 5첩 반상 등이 그 예이다. 밥과 반찬 사이엔 국과 장(간장 등)도 \n"
					 + "꼭 포함시켜 사람마다 자기 취향에 맞춰서 간을 조절할 수 있도록 해 놓았다. 김치류도 반찬에 포함되지 않았다. 이렇게 맨밥과 같이 먹기 위해 설계된 반찬을 볼 수 있는 나라는\n"
					 + "한국과 일본 정도다. 김치, 젓갈, 깻잎, 무말랭이 등 간이 센 반찬도 큰 비중을 차지한다."
					);
			openMenu();
		}
		else if(menu.equals("뒤로") || menu.equals("3")) {
			System.out.println("메인메뉴로 이동합니다.");
		}
		// 메뉴에 없는 것을 고르면 openMenu실행
		else {
			System.out.println("목록에 존재하지 않습니다. 다시 입력해주세요.");
			openMenu();
		}
		
		
	}
}
